{"id":509026,"xmlId":"Docker","name":"Docker","description":"<p>The <a href=\"https://www.jetbrains.com/help/idea/docker.html\">Docker Plugin</a> for JetBrains IDEs provides seamless integration with Docker and Podman (initial support), enabling developers to build, run, and manage containers directly within their preferred JetBrains environment. This powerful plugin simplifies containerized application development, making it easier to deploy, test, and debug applications in containers.</p>\n\n<h2>Key Features</h2>\n<ul>\n  <li>Effortlessly manage <a href=\"https://www.jetbrains.com/help/idea/docker-images.html\">Docker Images</a>, <a href=\"https://www.jetbrains.com/help/idea/docker-containers.html\">Containers</a>, and <a href=\"https://www.jetbrains.com/help/idea/docker-compose.html\">Compose projects</a> without leaving your JetBrains IDE.</li>\n  <li>Start, stop, and inspect Docker containers. Monitor container logs and interact with running containers through an integrated terminal.</li>\n  <li>Write, edit, and manage Dockerfiles and Docker Compose files with syntax highlighting, code completion, and validation features.</li>\n  <li>Create and manage Docker-based run configurations, including Docker Image, Dockerfile, and Docker Compose configurations, to streamline your development and deployment workflows.</li>\n  <li>Define and configure Docker run targets to test your applications in isolated and reproducible environments.</li>\n  <li>Access logs to diagnose and resolve issues with your Docker containers.</li>\n  <li>Enjoy support for <a href=\"https://www.jetbrains.com/help/idea/podman.html\">Podman</a>, an alternative container engine, providing flexibility and choice for container management.</li>\n</ul>\n\n<p>To configure, open <b>Settings | Build, Execution, Deployment | Docker</b>.</p>\n\n<p><a href=\"https://www.jetbrains.com/help/idea/docker.html\">Documentation</a></p>","organization":"JetBrains s.r.o.","tags":["Tools Integration"],"version":"233.15026.15","dependencies":["com.intellij.modules.lang","com.intellij.modules.remoteServers"],"optionalDependencies":["com.intellij.java","org.jetbrains.plugins.yaml","com.intellij.modules.ssh","intellij.clouds.docker.ssh","org.jetbrains.plugins.remote-run"],"since":"233.15026","until":"233.*","size":5277320,"vendor":"JetBrains"}