{"id":509036,"xmlId":"com.jetbrains.space","name":"Space","description":"\n    \n            <b>JetBrains Space</b>  is an intelligent code collaboration platform that combines supercharged Git hosting, advanced code\n            reviews with quality gates, CI/CD solutions, packages, and more. Space can completely cover your development pipeline while\n            integrating with JetBrains IDEs and your current tools.<br><br>\n\n            <a href=\"https://www.jetbrains.com/space/?utm_source=product&amp;utm_medium=link&amp;utm_campaign=IU&amp;utm_content=13362-space&amp;utm_term=description\">\n            Explore Space and sign up for free</a><br><br>\n\n            Host or mirror your project in Space to supercharge your Git hosting with native IDE integration. Browse projects, clone\n            repositories, and review code right from the IDE. Focus on writing code while Space creates feature branches and automatically\n            links commits and merge requests to issues.\n            \n  \n<h2>Getting started</h2>\n<p>Space plugin is intended for JetBrains Space members that use IntelliJ-based IDEs to work on their projects. It links your IDE with your organization at JetBrains Space and lets you view and clone project repositories and navigate to Space features right from the IDE.</p>\n\n<p>Space plugin works across all JetBrains IDEs of the latest version (2019.3+). The Space plugin is bundled in <a href=\"https://www.jetbrains.com/idea/\">IntelliJ IDEA</a> starting from version 2021.1 and <a href=\"https://www.jetbrains.com/pycharm/\">PyCharm</a> from version 2021.2. You can install the plugin manually in our other IntelliJ-based IDEs.\n</p>\n\n<h3>Log in to Space</h3>\n\n<p>Before you can start using Space plugin, you need to provide it with your Space organization address and log in to Space.</p>\n\n<ol>\n<li>In your IDE, go to <strong>Tools</strong> &gt; <strong>Space</strong> &gt; <strong>Log in to Space</strong></li>\n\n<li>Enter the address of your Space organization website, e.g <em>https://mycompany.jetbrains.space</em>\n(Make sure to enter the full URL starting with <em>https://</em>)</li>\n</ol>\n\n<p>The Space login screen will open in a browser where you can enter your Space credentials.  If you're successfully logged in, your Space avatar will be displayed in the IDE.</p>\n\n<h3>View and clone repositories</h3>\n\n<p>View all projects and repositories hosted in your Space organization then clone a repository you want to contribute to.</p>\n\n<ol>\n<li>In your IDE, go to <strong>Tools</strong> &gt; <strong>Space</strong> &gt; <strong>Clone Repository</strong>.  A list of projects and repositories will be displayed.</li>\n\n<li>To clone a repository to your machine, select it from the list and click <strong>OK</strong>.</li>\n</ol>\n\n<h3>Navigate to Space features</h3>\n\n<p>Quickly navigate to the issues, checklists, or code reviews associated with the project you're currently working on in your IDE.</p>\n\n<ol>\n<li>In your IDE, go to <strong>Tools</strong> &gt; <strong>Space</strong></li>\n\n<li>Choose what you'd like to see:</li>\n</ol>\n\n<ul>\n<li><strong>Code Reviews</strong></li>\n\n<li><strong>Checklists</strong></li>\n\n<li>or <strong>Issues</strong></li>\n</ul>\n\n<p>The Code Reviews will open right in your IDE, the Checklists and Issues will open in your browser.</p>\n\n\n<br>\n<p>When viewing a commit log in your IDE, instantly open a commit in Space to comment on it, start a code review, or contact the author.</p>\n\n<ol>\n<li>In your IDE's <strong>Version Control</strong> tool window open the <strong>Log</strong> tab.</li>\n\n<li>Right-click a commit and choose <strong>Open in Space</strong>.</li>\n</ol>\n\n<p>The selected commit will open in your browser.</p>","organization":"JetBrains s.r.o.","tags":["Tools Integration"],"vendor":"JetBrains","version":"233.15026.16","notes":"\n  \n    <h1>What's new in 2023.3</h1>\n\n    <ul>\n      <li>\n        The plugin has been updated to support actions that let you navigate from a repository or code review in Space to the corresponding\n        files in your IDE via the \"Start coding\" button.\n      </li>\n      <li>\n        You also have the option to navigate directly from a Space issue to the repository where you want to find and fix the problem.\n      </li>\n      <li>\n        We added search support with autocompletion for Maven packages hosted in Space repos.\n      </li>\n      <li>\n        We added the option to start a merge request directly from a changelist in the IDE.\n      </li>\n      <li>\n        Minor improvements include faster loading for JAR files that support a DSL and reading indicators in the list of code reviews.\n      </li>\n    </ul>\n    \n  ","optionalDependencies":["com.intellij.modules.vcs","Git4Idea","intellij.space.kotlin.scripting","intellij.space.vcs","org.jetbrains.kotlin","intellij.indexing.shared","com.intellij.java","org.jetbrains.idea.reposearch","org.jetbrains.idea.maven","com.jetbrains.php","com.jetbrains.gateway"],"since":"233.15026","until":"233.*","size":26519473}